OpenFOAM-v2506/modules/adios/tutorials/lagrangian/coalChemistryFoam/simplifiedSiwek/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name ignitionCells;
        type cellSet;
        action new;

        source  sphereToCell;
        origin  (0.125 0.375 0.05);
        radius  0.005;
    }
);


// ************************************************************************* //
